

const getAge = birthDate => Math.floor((new Date() - new Date(birthDate).getTime()) / 3.15576e+10)

export default function AboutTextMain() {
    return (
        <>
            <p className='text-sm font-mono font-bold text-slate-300'>
                Привет! Меня зовут Илья, я живу в Ростове-на-Дону и люблю программирование, творчество, процесс обучения и путешествия!
                Сейчас мне {getAge("2009-11-14")} лет. В основном, я занимаюсь разработкой Backend или Frontend приложений.
                Для разработки Backend приложений я люблю использовать Python как основной ЯП, мне нравится реализовывать слоистую архитектуру
                и использовать разные паттерны из DDD (Domain-Driven-Design). Я нацелен на то, чтобы писать чистый и понятный код, который легко поддерживать.
                Почти каждое свое приложение я запускаю в Docker-контейнерах. А теперь поговорим о фронтенде.
                Я, в основном, не Frontend разработчик. Занимаюсь Frontend лишь в pet-проектах и не претендую на мастерство в этой области, так как
                по-большей части я пишу Backend. Но, для Frontend разработки я изучил JavaScript и пишу Frontend приложения на React с применением
                UI-библиотек и стейт-менеджеров, и мне это нравится. Этот простенький сайт держится на старом CRA и использует Tailwind, в нем ничего особенного и он может
                выглядеть слегка по-хипстерски, но так и задумано :)
    
                Я всегда открыт к использованию новых технологий в разработке и изучению чего-то нового.
                Мне нравится продумывать логические цепочки в своем коде, продумывать архитектуру и делать невероятные вещи с применением
                множества технологий, практик и техник программирования. Это действительно творческий процесс.
            </p>
        </>
    );
}
